/****************************
 * 常用正则配置
 ****************************/

(function () {

	exports.regexpRule = {

		"STRING" : /^[a-zA-Z]{1,}$/,    		            //英文字符串规则
        "COMMON" : /^[a-zA-Z0-9]{1,}$/,                    //英文数字规则
		"NUMBER" : /^\d{0,}$/,						   		//整数规则
		"MONEY"  : /^[0-9]+(\.)?[0-9]{0,2}$/,   	   	    //金额规则
		"URL"    : /^(http|https):\/\/[a-zA-Z0-9]*/,       //网址规则
		"PHONE"  : /^[1][358][0-9]{9}$/,				   	//手机规则
		"SWITCH" : /^(0|1){1}$/						   	//开关规则（0或1）
	}

}).call(this);